/* =========================================================
1. Таблиця Employees.
Напишіть запит для вибору імен, прізвищ, окладів усіх 
працівників та їх id департаменту, оклад яких не
перевищує 10000.
========================================================= */

SELECT first_name,
last_name,
salary,
department_id
FROM HR.employees
WHERE salary <= 10000;

/* =========================================================
2. Таблиця Employees.
Напишіть запит для відображення імен, прізвищ, ідентифікаторів 
посад та комісійних винагород всіх працівників, які не мають права
на отримання комісійної винагороди.
========================================================= */

SELECT first_name,
last_name,
job_id,
commission_pct
FROM HR.employees
WHERE commission_pct IS NULL;

/* =========================================================
3. Таблиця Employees.
Напишіть 2 варіанти запиту для відображення списку всіх імен,
 прізвищ та їх id департаменту, де імʼя співробітника John.
========================================================= */

/*1 варіант*/

SELECT first_name,
last_name,
department_id
FROM HR.employees
WHERE first_name = 'John';

/* 2 варіант*/

SELECT first_name,
last_name,
department_id
FROM HR.employees
WHERE first_name LIKE 'John';

/* =========================================================
4. Таблиця Employees.
Напишіть запит для відображення імен, прізвищ співробітників
 із ЗП із 80-го департаменту і ЗП менше 10000.
========================================================= */

SELECT first_name,
last_name,
department_id,
salary
FROM HR.employees
WHERE department_id = 80
AND salary < 10000;

/* =========================================================
5. Таблиця Employees.
Напишіть запит для відображення імен, прізвищ співробітників 
із ЗП із 80-го і із 110 департаменту, ЗП
яких знаходиться в діапазоні від 10000 до 17000.
========================================================= */

SELECT first_name,
last_name,
department_id,
salary
FROM HR.employees
WHERE department_id IN (80, 110)
AND salary BETWEEN 10000 AND 17000;

/* =========================================================
6. Таблиця Employees.
Напишіть запит для відображення імен, прізвищ співробітників
із ЗП із 80-го і із 110 департаменту, ЗП яких знаходиться в діапазоні від 10000 до 17000 
і які отримують комісію. (У 110 відділі не отримують комісії) 
========================================================= */

SELECT first_name,
last_name,
department_id,
salary,
commission_pct
FROM HR.employees
WHERE department_id IN (80, 110)
AND salary BETWEEN 10000 AND 17000
AND commission_pct IS NOT NULL;

/* =========================================================
7. Таблиця Employees.
Напишіть запит для відображення списку всіх імен, прізвищ
співробітників, у кого ім’я починається на D
та підпорядковується менеджеру 108.
========================================================= */

SELECT first_name,
last_name
FROM HR.employees
WHERE first_name LIKE 'D%'
AND manager_id = 108;
